app/Controllers/Auth.php

            ];

            $patientsModel = new \App\Models\PatientsModel();
            $query = $patientsModel->insert($values);
---
INSERT INTO `patients` (`name`, `email`, `password`) VALUES ('Mona', 'mona@gmail.com', '$2y$10$SODY3.Dh1N8/64NFXeM.beYC.dlWM0intCQZIixXQMaJ4D0cmJn7.')

        function check(){

            $validation = $this->validate([
                'email'=>[
                    'rules'=>'required|valid_email|is_not_unique[patients.email]',
                    'errors'=>[
                        'required'=>'Email is required',
                        'valid_email'=>'Enter a valid email address',
                        'is_not_unique'=>'This email is not registered'
                    ]
                    ],
                    'password'=>[
                    'rules'=>'required|min_length[8]|max_length[12]',
                    'errors'=>[
                        'required'=>'Password is required',
                        'min_length'=>'Password must have at least 8 characters',
                        'max_length'=>'Password must not exceed 12 characters'
                    ]
                    ]
                ]);

            if(!$validation){
                return view ('auth/login',['validation'=> $this->validator]);
            }else {

                $email = $this->request->getPost('email');
                $password = $this->request->getPost('password');
                $patientsModel = new \App\Models\PatientsModel();
                $patient_info = $patientsModel-> where('email', $email)->first();
---
SELECT *
FROM `patients`
WHERE `email` = 'mona@gmail.com'
 LIMIT 1